app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def index
    @blog_posts = BlogPost.all

INSERT INTO "blog_posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 05 Apr 2014 21:03:56 UTC +00:00], ["updated_at", Sat, 05 Apr 2014 21:03:56 UTC +00:00]]
---
  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_blog_post
      @blog_post = BlogPost.find(params[:id])