app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "try try try"], ["created_at", Sat, 05 Apr 2014 23:33:39 UTC +00:00], ["title", "our third post"], ["updated_at", Sat, 05 Apr 2014 23:33:39 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "Christian Bale"], ["content", "The dark knight"], ["updated_at", Sun, 06 Apr 2014 00:41:48 UTC +00:00]]
---
  def update

    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])